/*********************************************************************************************************************
* TC264 Opensourec Library 锟斤拷锟斤拷TC264 锟斤拷源锟解）锟斤拷一锟斤拷锟斤拷锟节官凤拷 SDK 锟接口的碉拷锟斤拷锟斤拷锟斤拷源锟斤拷
* Copyright (c) 2022 SEEKFREE 锟斤拷煽萍锟�?
*
* 锟斤拷锟侥硷拷锟斤拷 TC264 锟斤拷源锟斤拷锟揭伙拷锟斤拷锟�?
*
* TC264 锟斤拷源锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷锟�?
* 锟斤拷锟斤拷锟皆革拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷岱拷锟斤拷锟�? GPL锟斤拷GNU General Public License锟斤拷锟斤拷 GNU通锟矫癸拷锟斤拷锟斤拷锟斤拷证锟斤拷锟斤拷锟斤拷锟斤拷
* 锟斤拷 GPL 锟侥碉拷3锟芥（锟斤拷 GPL3.0锟斤拷锟斤拷锟斤拷选锟斤拷模锟斤拷魏魏锟斤拷锟斤拷陌姹撅拷锟斤拷锟斤拷路锟斤拷锟斤拷锟�?/锟斤拷锟睫革拷锟斤拷
*
* 锟斤拷锟斤拷源锟斤拷姆锟斤拷锟斤拷锟较ｏ拷锟斤拷锟斤拷芊锟斤拷锟斤拷锟斤拷茫锟斤拷锟斤拷锟轿达拷锟斤拷锟斤拷锟斤拷魏蔚谋锟斤拷?
* 锟斤拷锟斤拷没锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟皆伙拷锟绞猴拷锟截讹拷锟斤拷途锟侥憋拷证
* 锟斤拷锟斤拷细锟斤拷锟斤拷渭锟�? GPL
*
* 锟斤拷应锟斤拷锟斤拷锟秸碉拷锟斤拷锟斤拷源锟斤拷锟酵憋拷盏锟揭伙拷锟�? GPL 锟侥革拷锟斤拷
* 锟斤拷锟矫伙拷校锟斤拷锟斤拷锟斤拷<https://www.gnu.org/licenses/>
*
* 锟斤拷锟斤拷注锟斤拷锟斤拷
* 锟斤拷锟斤拷源锟斤拷使锟斤拷 GPL3.0 锟斤拷源锟斤拷锟斤拷证协锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷为锟斤拷锟侥版本
* 锟斤拷锟斤拷锟斤拷锟斤拷英锟侥帮拷锟斤拷 libraries/doc 锟侥硷拷锟斤拷锟铰碉拷 GPL3_permission_statement.txt 锟侥硷拷锟斤拷
* 锟斤拷锟斤拷证锟斤拷锟斤拷锟斤拷 libraries 锟侥硷拷锟斤拷锟斤拷 锟斤拷锟斤拷锟侥硷拷锟斤拷锟铰碉拷 LICENSE 锟侥硷拷
* 锟斤拷迎锟斤拷位使锟矫诧拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷 锟斤拷锟睫革拷锟斤拷锟斤拷时锟斤拷锟诫保锟斤拷锟斤拷煽萍锟斤拷陌锟饺拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟�?
*
* 锟侥硷拷锟斤拷锟斤拷          cpu0_main
* 锟斤拷司锟斤拷锟斤拷          锟缴讹拷锟斤拷煽萍锟斤拷锟斤拷薰锟斤拷?
* 锟芥本锟斤拷息          锟介看 libraries/doc 锟侥硷拷锟斤拷锟斤拷 version 锟侥硷拷 锟芥本说锟斤拷
* 锟斤拷锟斤拷锟斤拷锟斤拷          ADS v1.10.2
* 锟斤拷锟斤拷平台          TC264D
* 锟斤拷锟斤拷锟斤拷锟斤拷          https://seekfree.taobao.com/
*
* 锟睫改硷拷录
* 锟斤拷锟斤拷              锟斤拷锟斤拷                锟斤拷注
* 2022-09-15       pudding            first version
********************************************************************************************************************/
#include "zf_common_headfile.h"
#pragma section all "cpu0_dsram"
// 锟斤拷锟斤拷锟斤拷锟斤拷锟�?#pragma section all restore锟斤拷锟街拷锟斤拷全锟街憋拷锟斤拷锟斤拷锟斤拷锟斤拷CPU0锟斤拷RAM锟斤拷

// 锟斤拷锟斤拷锟斤拷锟角匡拷源锟斤拷展锟斤拷锟�? 锟斤拷锟斤拷锟斤拷锟斤拷植锟斤拷锟竭诧拷锟皆革拷锟斤拷锟斤拷锟斤拷锟斤拷
// 锟斤拷锟斤拷锟斤拷锟角匡拷源锟斤拷展锟斤拷锟�? 锟斤拷锟斤拷锟斤拷锟斤拷植锟斤拷锟竭诧拷锟皆革拷锟斤拷锟斤拷锟斤拷锟斤拷
// 锟斤拷锟斤拷锟斤拷锟角匡拷源锟斤拷展锟斤拷锟�? 锟斤拷锟斤拷锟斤拷锟斤拷植锟斤拷锟竭诧拷锟皆革拷锟斤拷锟斤拷锟斤拷锟斤拷

// **************************** 锟斤拷锟斤拷锟斤拷锟斤拷 ****************************
int core0_main(void)
{
    clock_init();                   // 锟斤拷取时锟斤拷频锟斤拷<锟斤拷乇锟斤拷锟�?>
    debug_init();                   // 锟斤拷始锟斤拷默锟较碉拷锟皆达拷锟斤拷
    // 锟剿达拷锟斤拷写锟矫伙拷锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷锟绞硷拷锟斤拷锟斤拷锟斤拷
    ips114_init();
    mt9v03x_double_init(mt9v03x_1);
    buzzer_init();
    Encoder_Init();
    Encoder_Data_Get_Init();
    motor_init();
    Pid_Init();
    pit_ms_init(CCU60_CH0, 5);
    pit_ms_init(CCU60_CH1,10);
    // 锟剿达拷锟斤拷写锟矫伙拷锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷锟绞硷拷锟斤拷锟斤拷锟斤拷
    cpu_wait_event_ready();         // 锟饺达拷锟斤拷锟叫猴拷锟侥筹拷始锟斤拷锟斤拷锟�?
    while (TRUE)
    {
        //Motor_SetSpeed(900,900);//留着开环转转
        // 锟剿达拷锟斤拷写锟斤拷要循锟斤拷执锟叫的达拷锟斤拷
        if(mt9v03x_finish_flag_1==1)
        {
            image_invocation();
            ips114_screen();
            ips114_show_gray_image(0, 0, mt9v03x_image_1[0], MT9V03X_1_W, MT9V03X_1_H,MT9V03X_1_W/2 ,MT9V03X_1_H/2, threhold);
            ips114_show_line();
            mt9v03x_finish_flag_1=0;
        }



        // 锟剿达拷锟斤拷写锟斤拷要循锟斤拷执锟叫的达拷锟斤拷
    }
}

#pragma section all restore
// **************************** 锟斤拷锟斤拷锟斤拷锟斤拷 ****************************
